Revit 2027 API
ParameterTypeId.SteelElemAnchorTotalWeight Property
 "Total Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemAnchorTotalWeight { get; }
Public Shared ReadOnly Property SteelElemAnchorTotalWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemAnchorTotalWeight {
	ForgeTypeId^ get ();
}
static member SteelElemAnchorTotalWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace